``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route53_record.beacon-import-galaxyproject will be updated in-place
  ~ resource "aws_route53_record" "beacon-import-galaxyproject" {
        id              = "Z386N8B8JBC6TQ_beacon-import.galaxyproject.eu_A"
        name            = "beacon-import.galaxyproject.eu"
      ~ records         = [
          - "10.5.68.121",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.it-subdomain-main[0] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.annotation.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[1] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.aqua.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[2] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.beta.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[3] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.build.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[4] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.cheminformatics.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[5] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.climate.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[6] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.clipseq.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[7] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.ecology.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[8] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.erasmusmc.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[9] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.graphclust.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[10] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.hicexplorer.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[11] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.humancellatlas.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[12] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.imaging.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[13] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[14] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.test.internal.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[15] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.live.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[16] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.metabolomics.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[17] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.metagenomics.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[18] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.nanopore.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[19] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.proteomics.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[20] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.rna.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[21] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.singlecell.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[22] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.stats.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[23] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.streetscience.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[24] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.test.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.it-subdomain-main[25] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.earth-system.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # openstack_compute_instance_v2.beacon-import will be created
  + resource "openstack_compute_instance_v2" "beacon-import" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.tiny"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "c6906a58-1e05-4be0-8f20-41f24c8320b5"
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "beacon-import.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
        ]
      + stop_before_destroy = false
      + user_data           = "f1afc818d33a9c6c68d6c2dd4401f2e9abd7f8fc"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "bioinf"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

Plan: 27 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```